RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_can.c
/**
 **************************************************************************
 * File Name    : at32f4xx_can.c
 * Description  : at32f4xx CAN source file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_can.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup CAN
  * @brief CAN driver modules
  * @{
  */

/** @defgroup CAN_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup CAN_Private_Defines
  * @{
  */

/* CAN Master Control Register bits */

#define MCR_DBF                     ((uint32_t)0x00010000) /* software master reset */

/* CAN Mailbox Transmit Request */
#define TMIDxR_TXRQ                 ((uint32_t)0x00000001) /* Transmit mailbox request */

/* CAN Filter Master Register bits */
#define FM_FINIT                    ((uint32_t)0x00000001) /* Filter init mode */

/* Time out for INAK bit */
#define IAK_TIMEOUT                 ((uint32_t)0x0000FFFF)
/* Time out for SLAK bit */
#define SAK_TIMEOUT                 ((uint32_t)0x0000FFFF)



/* Flags in TSR register */
#define CAN_FLAGS_TTST              ((uint32_t)0x08000000)
/* Flags in RF1R register */
#define CAN_FLAGS_RF1               ((uint32_t)0x04000000)
/* Flags in RF0R register */
#define CAN_FLAGS_RF0               ((uint32_t)0x02000000)
/* Flags in MSR register */
#define CAN_FLAGS_MSTS              ((uint32_t)0x01000000)
/* Flags in ESR register */
#define CAN_FLAGS_ESTS              ((uint32_t)0x00F00000)

/* Mailboxes definition */
#define CAN_TXMAILBOX_0             ((uint8_t)0x00)
#define CAN_TXMAILBOX_1             ((uint8_t)0x01)
#define CAN_TXMAILBOX_2             ((uint8_t)0x02)



#define CAN_MODE_MSK                ((uint32_t) 0x00000003)
/**
  * @}
  */

/** @defgroup CAN_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup CAN_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup CAN_Private_FunctionPrototypes
  * @{
  */

static ITStatus CheckINTStatus(uint32_t CAN_Reg, uint32_t It_Bit);

/**
  * @}
  */

/** @defgroup CAN_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the CAN peripheral registers to their default reset values.
  * @param  CANx: where x can be only 1 to select the CAN peripheral.
  * @retval None.
  */
void CAN_Reset(CAN_Type* CANx)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  if (CANx == CAN1)
  {
    /* Enable CAN1 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_CAN1, ENABLE);
    /* Release CAN1 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_CAN1, DISABLE);
  }
#ifdef AT32F413xx
#ifndef AT32FEBKCx_MD
  if (CANx == CAN2)
  {
    /* Enable CAN1 reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_CAN2, ENABLE);
    /* Release CAN1 from reset state */
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_CAN2, DISABLE);
  }
#endif
#endif
}

/**
  * @brief  Initializes the CAN peripheral according to the specified
  *         parameters in the CAN_InitStruct.
  * @param  CANx:           where x can be only 1 to to select the CAN
  *                         peripheral.
  * @param  CAN_InitStruct: pointer to a CAN_InitType structure that
  *                         contains the configuration information for the
  *                         CAN peripheral.
  * @retval Constant indicates initialization succeed which will be
  *         CAN_InitStatus_Failed or CAN_InitStatus_Success.
  */
uint8_t CAN_Init(CAN_Type* CANx, CAN_InitType* CAN_InitStruct)
{
  uint8_t InitStatus = CAN_InitStatus_Failed;
  uint32_t wait_ack = 0x00000000;
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_TTC));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_ABO));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_AWU));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_NART));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_RFL));
  assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_TFP));
  assert_param(IS_CAN_MODE(CAN_InitStruct->CAN_Mode));
  assert_param(IS_CAN_SJW(CAN_InitStruct->CAN_SJW));
  assert_param(IS_CAN_BS1(CAN_InitStruct->CAN_BS1));
  assert_param(IS_CAN_BS2(CAN_InitStruct->CAN_BS2));
  assert_param(IS_CAN_PRESCALER(CAN_InitStruct->CAN_Prescaler));

  /* Exit from sleep mode */
  CANx->MCTRL &= (~(uint32_t)CAN_MCTRL_SLP);

  /* Request initialisation */
  CANx->MCTRL |= CAN_MCTRL_INRQ ;

  /* Wait the acknowledge */
  while (((CANx->MSTS & CAN_MSTS_IAK) != CAN_MSTS_IAK) && (wait_ack != IAK_TIMEOUT))
  {
    wait_ack++;
  }

  /* Check acknowledge */
  if ((CANx->MSTS & CAN_MSTS_IAK) != CAN_MSTS_IAK)
  {
    InitStatus = CAN_InitStatus_Failed;
  }
  else
  {
    /* Set the time triggered communication mode */
    if (CAN_InitStruct->CAN_TTC == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_TTC;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_TTC;
    }

    /* Set the automatic bus-off management */
    if (CAN_InitStruct->CAN_ABO == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_ABO;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_ABO;
    }

    /* Set the automatic wake-up mode */
    if (CAN_InitStruct->CAN_AWU == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_AWU;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_AWU;
    }

    /* Set the no automatic retransmission */
    if (CAN_InitStruct->CAN_NART == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_NART;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_NART;
    }

    /* Set the receive FIFO locked mode */
    if (CAN_InitStruct->CAN_RFL == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_RFL;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_RFL;
    }

    /* Set the transmit FIFO priority */
    if (CAN_InitStruct->CAN_TFP == ENABLE)
    {
      CANx->MCTRL |= CAN_MCTRL_TFP;
    }
    else
    {
      CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_TFP;
    }

    /* Set the bit timing register */
    CANx->BTMG = (uint32_t)((uint32_t)CAN_InitStruct->CAN_Mode << 30) | \
                 ((uint32_t)CAN_InitStruct->CAN_SJW << 24) | \
                 ((uint32_t)CAN_InitStruct->CAN_BS1 << 16) | \
                 ((uint32_t)CAN_InitStruct->CAN_BS2 << 20) | \
                 ((uint32_t)CAN_InitStruct->CAN_Prescaler - 1);

    /* Request leave initialisation */
    CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_INRQ;

    /* Wait the acknowledge */
    wait_ack = 0;

