RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_can.c
  /* Select one empty transmit mailbox */
  if ((CANx->TSTS & CAN_TSTS_TSME0) == CAN_TSTS_TSME0)
  {
    transmit_mailbox = 0;
  }
  else if ((CANx->TSTS & CAN_TSTS_TSME1) == CAN_TSTS_TSME1)
  {
    transmit_mailbox = 1;
  }
  else if ((CANx->TSTS & CAN_TSTS_TSME2) == CAN_TSTS_TSME2)
  {
    transmit_mailbox = 2;
  }
  else
  {
    transmit_mailbox = CAN_TxStatus_NoMailBox;
  }

  if (transmit_mailbox != CAN_TxStatus_NoMailBox)
  {
    /* Set up the Id */
    CANx->TxMailBox[transmit_mailbox].TMI &= TMIDxR_TXRQ;

    if (TxMessage->IDT == CAN_Id_Standard)
    {
      assert_param(IS_CAN_STDID(TxMessage->StdId));
      CANx->TxMailBox[transmit_mailbox].TMI |= ((TxMessage->StdId << 21) | \
          TxMessage->RTR);
    }
    else
    {
      assert_param(IS_CAN_EXTID(TxMessage->ExtId));
      CANx->TxMailBox[transmit_mailbox].TMI |= ((TxMessage->ExtId << 3) | \
          TxMessage->IDT | \
          TxMessage->RTR);
    }

    /* Set up the DLC */
    TxMessage->DLC &= (uint8_t)0x0000000F;
    CANx->TxMailBox[transmit_mailbox].TDT &= (uint32_t)0xFFFFFFF0;
    CANx->TxMailBox[transmit_mailbox].TDT |= TxMessage->DLC;

    /* Set up the data field */
    CANx->TxMailBox[transmit_mailbox].TDL = (((uint32_t)TxMessage->Data[3] << 24) |
                                            ((uint32_t)TxMessage->Data[2] << 16) |
                                            ((uint32_t)TxMessage->Data[1] << 8) |
                                            ((uint32_t)TxMessage->Data[0]));
    CANx->TxMailBox[transmit_mailbox].TDH = (((uint32_t)TxMessage->Data[7] << 24) |
                                            ((uint32_t)TxMessage->Data[6] << 16) |
                                            ((uint32_t)TxMessage->Data[5] << 8) |
                                            ((uint32_t)TxMessage->Data[4]));
    /* Request transmission */
    CANx->TxMailBox[transmit_mailbox].TMI |= TMIDxR_TXRQ;
  }

  return transmit_mailbox;
}

/**
  * @brief  Checks the transmission of a message.
  * @param  CANx:            where x can be only 1 to to select the
  *                          CAN peripheral.
  * @param  TransmitMailbox: the number of the mailbox that is used for
  *                          transmission.
  * @retval CAN_TxStatus_Ok if the CAN driver transmits the message, CAN_TxStatus_Failed
  *         in an other case.
  */
uint8_t CAN_TransmitStatus(CAN_Type* CANx, uint8_t TransmitMailbox)
{
  uint32_t state = 0;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_TRANSMITMAILBOX(TransmitMailbox));

  switch (TransmitMailbox)
  {
  case (CAN_TXMAILBOX_0):
    state =   CANx->TSTS &  (CAN_TSTS_RQC0 | CAN_TSTS_TOK0 | CAN_TSTS_TSME0);
    break;

  case (CAN_TXMAILBOX_1):
    state =   CANx->TSTS &  (CAN_TSTS_RQC1 | CAN_TSTS_TOK1 | CAN_TSTS_TSME1);
    break;

  case (CAN_TXMAILBOX_2):
    state =   CANx->TSTS &  (CAN_TSTS_RQC2 | CAN_TSTS_TOK2 | CAN_TSTS_TSME2);
    break;

  default:
    state = CAN_TxStatus_Failed;
    break;
  }

  switch (state)
  {
    /* transmit pending  */
  case (0x0):
    state = CAN_TxStatus_Pending;
    break;

    /* transmit failed  */
  case (CAN_TSTS_RQC0 | CAN_TSTS_TSME0):
    state = CAN_TxStatus_Failed;
    break;

  case (CAN_TSTS_RQC1 | CAN_TSTS_TSME1):
    state = CAN_TxStatus_Failed;
    break;

  case (CAN_TSTS_RQC2 | CAN_TSTS_TSME2):
    state = CAN_TxStatus_Failed;
    break;

    /* transmit succeeded  */
  case (CAN_TSTS_RQC0 | CAN_TSTS_TOK0 | CAN_TSTS_TSME0):
    state = CAN_TxStatus_Ok;
    break;

  case (CAN_TSTS_RQC1 | CAN_TSTS_TOK1 | CAN_TSTS_TSME1):
    state = CAN_TxStatus_Ok;
    break;

  case (CAN_TSTS_RQC2 | CAN_TSTS_TOK2 | CAN_TSTS_TSME2):
    state = CAN_TxStatus_Ok;
    break;

  default:
    state = CAN_TxStatus_Failed;
    break;
  }

  return (uint8_t) state;
}

/**
  * @brief  Cancels a transmit request.
  * @param  CANx:     where x can be only 1 to to select the CAN peripheral.
  * @param  Mailbox:  Mailbox number.
  * @retval None.
  */
void CAN_CancelTransmit(CAN_Type* CANx, uint8_t Mailbox)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_TRANSMITMAILBOX(Mailbox));

  /* abort transmission */
  switch (Mailbox)
  {
  case (CAN_TXMAILBOX_0):
    CANx->TSTS |= CAN_TSTS_ARQ0;
    break;

  case (CAN_TXMAILBOX_1):
    CANx->TSTS |= CAN_TSTS_ARQ1;
    break;

  case (CAN_TXMAILBOX_2):
    CANx->TSTS |= CAN_TSTS_ARQ2;
    break;

  default:
    break;
  }
}


/**
  * @brief  Receives a message.
  * @param  CANx:       where x can be only 1 to to select the CAN peripheral.
  * @param  FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  * @param  RxMessage:  pointer to a structure receive message which contains
  *                     CAN Id, CAN DLC, CAN datas and FMI number.
  * @retval None.
  */
void CAN_Receive(CAN_Type* CANx, uint8_t FIFONumber, CanRxMsg* RxMessage)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_FIFO(FIFONumber));
  /* Get the Id */
  RxMessage->IDT = (uint8_t)0x04 & CANx->FIFOMailBox[FIFONumber].RFI;

  if (RxMessage->IDT == CAN_Id_Standard)
  {
    RxMessage->StdId = (uint32_t)0x000007FF & (CANx->FIFOMailBox[FIFONumber].RFI >> 21);
  }
  else
  {
    RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->FIFOMailBox[FIFONumber].RFI >> 3);
  }

  RxMessage->RTR = (uint8_t)0x02 & CANx->FIFOMailBox[FIFONumber].RFI;
  /* Get the DLC */
  RxMessage->DLC = (uint8_t)0x0F & CANx->FIFOMailBox[FIFONumber].RDT;
  /* Get the FMI */
  RxMessage->FID = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDT >> 8);
  /* Get the data field */
  RxMessage->Data[0] = (uint8_t)0xFF & CANx->FIFOMailBox[FIFONumber].RDL;
  RxMessage->Data[1] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDL >> 8);
  RxMessage->Data[2] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDL >> 16);
  RxMessage->Data[3] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDL >> 24);
  RxMessage->Data[4] = (uint8_t)0xFF & CANx->FIFOMailBox[FIFONumber].RDH;
  RxMessage->Data[5] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDH >> 8);
  RxMessage->Data[6] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDH >> 16);
  RxMessage->Data[7] = (uint8_t)0xFF & (CANx->FIFOMailBox[FIFONumber].RDH >> 24);

  /* Release the FIFO */
  /* Release FIFO0 */
  if (FIFONumber == CAN_FIFO0)
  {
    CANx->RF0 |= CAN_RF0_RRFM0;
  }
  /* Release FIFO1 */
  else /* FIFONumber == CAN_FIFO1 */
  {
    CANx->RF1 |= CAN_RF1_RRFM1;
  }
}

/**
  * @brief  Releases the specified FIFO.
  * @param  CANx:       where x can be only 1 to to select the CAN peripheral.
  * @param  FIFONumber: FIFO to release, CAN_FIFO0 or CAN_FIFO1.
  * @retval None.
  */
void CAN_FIFORelease(CAN_Type* CANx, uint8_t FIFONumber)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_FIFO(FIFONumber));

  /* Release FIFO0 */
  if (FIFONumber == CAN_FIFO0)
  {
    CANx->RF0 |= CAN_RF0_RRFM0;
  }
  /* Release FIFO1 */
  else /* FIFONumber == CAN_FIFO1 */
  {
    CANx->RF1 |= CAN_RF1_RRFM1;
  }
}

/**
  * @brief  Returns the number of pending messages.
  * @param  CANx:       where x can be only 1 to to select the CAN peripheral.
  * @param  FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  * @retval NbMessage : which is the number of pending message.
  */
uint8_t CAN_MessagePending(CAN_Type* CANx, uint8_t FIFONumber)
{
  uint8_t message_pending = 0;
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_FIFO(FIFONumber));

  if (FIFONumber == CAN_FIFO0)
  {
    message_pending = (uint8_t)(CANx->RF0 & (uint32_t)0x03);
  }
  else if (FIFONumber == CAN_FIFO1)
  {
    message_pending = (uint8_t)(CANx->RF1 & (uint32_t)0x03);
  }
  else
  {
    message_pending = 0;
  }

  return message_pending;
}


/**
  * @brief   Select the CAN Operation mode.
  * @param CAN_OperatingMode : CAN Operating Mode. This parameter can be one
  *                            of @ref CAN_Operating_Mode enumeration.
  * @retval status of the requested mode which can be
  *         - CAN_ModeStatus_Failed    CAN failed entering the specific mode
  *         - CAN_ModeStatus_Success   CAN Succeed entering the specific mode

  */
uint8_t CAN_OperatingModeRequest(CAN_Type* CANx, uint8_t CAN_OperatingMode)
{
  uint8_t status = CAN_ModeStatus_Failed;

  /* Timeout for INAK or also for SLAK bits*/
  uint32_t timeout = IAK_TIMEOUT;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_OPERATING_MODE(CAN_OperatingMode));

