RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_can.c
  if (CAN_OperatingMode == CAN_OperatingMode_Initialization)
  {
    /* Request initialisation */
    CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_MCTRL_SLP)) | CAN_MCTRL_INRQ);

    /* Wait the acknowledge */
    while (((CANx->MSTS & CAN_MODE_MSK) != CAN_MSTS_IAK) && (timeout != 0))
    {
      timeout--;
    }

    if ((CANx->MSTS & CAN_MODE_MSK) != CAN_MSTS_IAK)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else  if (CAN_OperatingMode == CAN_OperatingMode_Normal)
  {
    /* Request leave initialisation and sleep mode  and enter Normal mode */
    CANx->MCTRL &= (uint32_t)(~(CAN_MCTRL_SLP | CAN_MCTRL_INRQ));

    /* Wait the acknowledge */
    while (((CANx->MSTS & CAN_MODE_MSK) != 0) && (timeout != 0))
    {
      timeout--;
    }

    if ((CANx->MSTS & CAN_MODE_MSK) != 0)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else  if (CAN_OperatingMode == CAN_OperatingMode_Sleep)
  {
    /* Request Sleep mode */
    CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_MCTRL_INRQ)) | CAN_MCTRL_SLP);

    /* Wait the acknowledge */
    while (((CANx->MSTS & CAN_MODE_MSK) != CAN_MSTS_SAK) && (timeout != 0))
    {
      timeout--;
    }

    if ((CANx->MSTS & CAN_MODE_MSK) != CAN_MSTS_SAK)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else
  {
    status = CAN_ModeStatus_Failed;
  }

  return  (uint8_t) status;
}

/**
  * @brief  Enters the low power mode.
  * @param  CANx:   where x can be only 1 to to select the CAN peripheral.
  * @retval status: CAN_Sleep_Ok if sleep entered, CAN_Sleep_Failed in an
  *                 other case.
  */
uint8_t CAN_Sleep(CAN_Type* CANx)
{
  uint8_t sleepstatus = CAN_Sleep_Failed;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  /* Request Sleep mode */
  CANx->MCTRL = (((CANx->MCTRL) & (uint32_t)(~(uint32_t)CAN_MCTRL_INRQ)) | CAN_MCTRL_SLP);

  /* Sleep mode status */
  if ((CANx->MSTS & (CAN_MSTS_SAK | CAN_MSTS_IAK)) == CAN_MSTS_SAK)
  {
    /* Sleep mode not entered */
    sleepstatus =  CAN_Sleep_Ok;
  }

  /* return sleep mode status */
  return (uint8_t)sleepstatus;
}

/**
  * @brief  Wakes the CAN up.
  * @param  CANx:    where x can be only 1 to to select the CAN peripheral.
  * @retval status:  CAN_WakeUp_Ok if sleep mode left, CAN_WakeUp_Failed in an
  *                  other case.
  */
uint8_t CAN_WakeUp(CAN_Type* CANx)
{
  uint32_t wait_slak = SAK_TIMEOUT;
  uint8_t wakeupstatus = CAN_WakeUp_Failed;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  /* Wake up request */
  CANx->MCTRL &= ~(uint32_t)CAN_MCTRL_SLP;

  /* Sleep mode status */
  while(((CANx->MSTS & CAN_MSTS_SAK) == CAN_MSTS_SAK) && (wait_slak != 0x00))
  {
    wait_slak--;
  }

  if((CANx->MSTS & CAN_MSTS_SAK) != CAN_MSTS_SAK)
  {
    /* wake up done : Sleep mode exited */
    wakeupstatus = CAN_WakeUp_Ok;
  }

  /* return wakeup status */
  return (uint8_t)wakeupstatus;
}


/**
  * @brief  Returns the CANx's last error code (LEC).
  * @param  CANx:          where x can be only 1 to to select the CAN peripheral.
  * @retval CAN_ErrorCode: specifies the Error code :
  *                        - CAN_ErrorCode_NoErr            No Error
  *                        - CAN_ErrorCode_StuffErr         Stuff Error
  *                        - CAN_ErrorCode_FormErr          Form Error
  *                        - CAN_ErrorCode_ACKErr           Acknowledgment Error
  *                        - CAN_ErrorCode_BitRecessiveErr  Bit Recessive Error
  *                        - CAN_ErrorCode_BitDominantErr   Bit Dominant Error
  *                        - CAN_ErrorCode_CRCErr           CRC Error
  *                        - CAN_ErrorCode_SoftwareSetErr   Software Set Error
  */

uint8_t CAN_GetLastErrorCode(CAN_Type* CANx)
{
  uint8_t errorcode = 0;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  /* Get the error code*/
  errorcode = (((uint8_t)CANx->ESTS) & (uint8_t)CAN_ESTS_ERC);

  /* Return the error code*/
  return errorcode;
}
/**
  * @brief  Returns the CANx Receive Error Counter (REC).
  * @note   In case of an error during reception, this counter is incremented
  *         by 1 or by 8 depending on the error condition as defined by the CAN
  *         standard. After every successful reception, the counter is
  *         decremented by 1 or reset to 120 if its value was higher than 128.
  *         When the counter value exceeds 127, the CAN controller enters the
  *         error passive state.
  * @param  CANx: where x can be only 1 to to select the CAN peripheral.
  * @retval CAN Receive Error Counter.
  */
uint8_t CAN_GetReceiveErrorCounter(CAN_Type* CANx)
{
  uint8_t counter = 0;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  /* Get the Receive Error Counter*/
  counter = (uint8_t)((CANx->ESTS & CAN_ESTS_REC) >> 24);

  /* Return the Receive Error Counter*/
  return counter;
}


/**
  * @brief  Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
  * @param  CANx:   where x can be only 1 to to select the CAN peripheral.
  * @retval LSB of the 9-bit CAN Transmit Error Counter.
  */
uint8_t CAN_GetLSBTransmitErrorCounter(CAN_Type* CANx)
{
  uint8_t counter = 0;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));

  /* Get the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
  counter = (uint8_t)((CANx->ESTS & CAN_ESTS_TEC) >> 16);

  /* Return the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
  return counter;
}


/**
  * @brief  Enables or disables the specified CANx interrupts.
  * @param  CANx:   where x can be only 1 to to select the CAN peripheral.
  * @param  CAN_INT: specifies the CAN interrupt sources to be enabled or disabled.
  *                 This parameter can be:
  *                 - CAN_INT_TSME,
  *                 - CAN_INT_RFP0,
  *                 - CAN_INT_RFFU0,
  *                 - CAN_INT_RFOV0,
  *                 - CAN_INT_RFP1,
  *                 - CAN_INT_RFFU1,
  *                 - CAN_INT_RFOV1,
  *                 - CAN_INT_ERG,
  *                 - CAN_INT_ERP,
  *                 - CAN_INT_LEC,
  *                 - CAN_INT_ERR,
  *                 - CAN_INT_WK or
  *                 - CAN_INT_SAK.
  * @param  NewState: new state of the CAN interrupts.
  *                   This parameter can be: ENABLE or DISABLE.
  * @retval None.
  */
void CAN_INTConfig(CAN_Type* CANx, uint32_t CAN_INT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_INT(CAN_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected CANx interrupt */
    CANx->INTEN |= CAN_INT;
  }
  else
  {
    /* Disable the selected CANx interrupt */
    CANx->INTEN &= ~CAN_INT;
  }
}
/**
  * @brief  Checks whether the specified CAN flag is set or not.
  * @param  CANx:     where x can be only 1 to to select the CAN peripheral.
  * @param  CAN_FLAG: specifies the flag to check.
  *                   This parameter can be one of the following flags:
  *                  - CAN_FLAG_ERG
  *                  - CAN_FLAG_ERP
  *                  - CAN_FLAG_BU
  *                  - CAN_FLAG_RQCP0
  *                  - CAN_FLAG_RQCP1
  *                  - CAN_FLAG_RQCP2
  *                  - CAN_FLAG_RFP1
  *                  - CAN_FLAG_RFFU1
  *                  - CAN_FLAG_RFOV1
  *                  - CAN_FLAG_RFP0
  *                  - CAN_FLAG_RFFU0
  *                  - CAN_FLAG_RFOV0
  *                  - CAN_FLAG_WK
  *                  - CAN_FLAG_SAK
  *                  - CAN_FLAG_ERC
  * @retval The new state of CAN_FLAG (SET or RESET).
  */
FlagStatus CAN_GetFlagStatus(CAN_Type* CANx, uint32_t CAN_FLAG)
{
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_GET_FLAG(CAN_FLAG));


