RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_can.c
  if((CAN_FLAG & CAN_FLAGS_ESTS) != (uint32_t)RESET)
  {
    /* Check the status of the specified CAN flag */
    if ((CANx->ESTS & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
    {
      /* CAN_FLAG is set */
      bitstatus = SET;
    }
    else
    {
      /* CAN_FLAG is reset */
      bitstatus = RESET;
    }
  }
  else if((CAN_FLAG & CAN_FLAGS_MSTS) != (uint32_t)RESET)
  {
    /* Check the status of the specified CAN flag */
    if ((CANx->MSTS & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
    {
      /* CAN_FLAG is set */
      bitstatus = SET;
    }
    else
    {
      /* CAN_FLAG is reset */
      bitstatus = RESET;
    }
  }
  else if((CAN_FLAG & CAN_FLAGS_TTST) != (uint32_t)RESET)
  {
    /* Check the status of the specified CAN flag */
    if ((CANx->TSTS & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
    {
      /* CAN_FLAG is set */
      bitstatus = SET;
    }
    else
    {
      /* CAN_FLAG is reset */
      bitstatus = RESET;
    }
  }
  else if((CAN_FLAG & CAN_FLAGS_RF0) != (uint32_t)RESET)
  {
    /* Check the status of the specified CAN flag */
    if ((CANx->RF0 & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
    {
      /* CAN_FLAG is set */
      bitstatus = SET;
    }
    else
    {
      /* CAN_FLAG is reset */
      bitstatus = RESET;
    }
  }
  else /* If(CAN_FLAG & CAN_FLAGS_RF1 != (uint32_t)RESET) */
  {
    /* Check the status of the specified CAN flag */
    if ((uint32_t)(CANx->RF1 & (CAN_FLAG & 0x000FFFFF)) != (uint32_t)RESET)
    {
      /* CAN_FLAG is set */
      bitstatus = SET;
    }
    else
    {
      /* CAN_FLAG is reset */
      bitstatus = RESET;
    }
  }

  /* Return the CAN_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the CAN's pending flags.
  * @param  CANx:     where x can be only 1 to to select the CAN peripheral.
  * @param  CAN_FLAG: specifies the flag to clear.
  *                   This parameter can be one of the following flags:
  *                    - CAN_FLAG_RQCP0
  *                    - CAN_FLAG_RQCP1
  *                    - CAN_FLAG_RQCP2
  *                    - CAN_FLAG_RFFU1
  *                    - CAN_FLAG_RFOV1
  *                    - CAN_FLAG_RFFU0
  *                    - CAN_FLAG_RFOV0
  *                    - CAN_FLAG_WK
  *                    - CAN_FLAG_SAK
  *                    - CAN_FLAG_ERC
  * @retval None.
  */
void CAN_ClearFlag(CAN_Type* CANx, uint32_t CAN_FLAG)
{
  uint32_t flagtmp = 0;
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_CLEAR_FLAG(CAN_FLAG));

  if (CAN_FLAG == CAN_FLAG_ERC) /* ESR register */
  {
    /* Clear the selected CAN flags */
    CANx->ESTS = (uint32_t)RESET;
  }
  else /* MSR or TSR or RF0R or RF1R */
  {
    flagtmp = CAN_FLAG & 0x000FFFFF;

    if ((CAN_FLAG & CAN_FLAGS_RF0) != (uint32_t)RESET)
    {
      /* Receive Flags */
      CANx->RF0 = (uint32_t)(flagtmp);
    }
    else if ((CAN_FLAG & CAN_FLAGS_RF1) != (uint32_t)RESET)
    {
      /* Receive Flags */
      CANx->RF1 = (uint32_t)(flagtmp);
    }
    else if ((CAN_FLAG & CAN_FLAGS_TTST) != (uint32_t)RESET)
    {
      /* Transmit Flags */
      CANx->TSTS = (uint32_t)(flagtmp);
    }
    else /* If((CAN_FLAG & CAN_FLAGS_MSTS)!=(uint32_t)RESET) */
    {
      /* Operating mode Flags */
      CANx->MSTS = (uint32_t)(flagtmp);
    }
  }
}

/**
  * @brief  Checks whether the specified CANx interrupt has occurred or not.
  * @param  CANx:    where x can be only 1 to to select the CAN peripheral.
  * @param  CAN_INT:  specifies the CAN interrupt source to check.
  *                  This parameter can be one of the following flags:
  *                 -  CAN_INT_TSME
  *                 -  CAN_INT_RFP0
  *                 -  CAN_INT_RFFU0
  *                 -  CAN_INT_RFOV0
  *                 -  CAN_INT_RFP1
  *                 -  CAN_INT_RFFU1
  *                 -  CAN_INT_RFOV1
  *                 -  CAN_INT_WK
  *                 -  CAN_INT_SAK
  *                 -  CAN_INT_ERG
  *                 -  CAN_INT_ERP
  *                 -  CAN_INT_BU
  *                 -  CAN_INT_LEC
  *                 -  CAN_INT_ERR
  * @retval The current state of CAN_INT (SET or RESET).
  */
ITStatus CAN_GetINTStatus(CAN_Type* CANx, uint32_t CAN_INT)
{
  ITStatus itstatus = RESET;
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_INT(CAN_INT));

  /* check the enable interrupt bit */
  if((CANx->INTEN & CAN_INT) != RESET)
  {
    /* in case the Interrupt is enabled, .... */
    switch (CAN_INT)
    {
    case CAN_INT_TSME:
      /* Check CAN_TSR_RQCPx bits */
      itstatus = CheckINTStatus(CANx->TSTS, CAN_TSTS_RQC0 | CAN_TSTS_RQC1 | CAN_TSTS_RQC2);
      break;

    case CAN_INT_RFP0:
      /* Check CAN_RF0_RFP0 bit */
      itstatus = CheckINTStatus(CANx->RF0, CAN_RF0_RFP0);
      break;

    case CAN_INT_RFFU0:
      /* Check CAN_RF0_RFFU0 bit */
      itstatus = CheckINTStatus(CANx->RF0, CAN_RF0_RFFU0);
      break;

    case CAN_INT_RFOV0:
      /* Check CAN_RF0_RFOV0 bit */
      itstatus = CheckINTStatus(CANx->RF0, CAN_RF0_RFOV0);
      break;

    case CAN_INT_RFP1:
      /* Check CAN_RF1_RFP1 bit */
      itstatus = CheckINTStatus(CANx->RF1, CAN_RF1_RFP1);
      break;

    case CAN_INT_RFFU1:
      /* Check CAN_RF1_RFFU1 bit */
      itstatus = CheckINTStatus(CANx->RF1, CAN_RF1_RFFU1);
      break;

    case CAN_INT_RFOV1:
      /* Check CAN_RF1_RFOV1 bit */
      itstatus = CheckINTStatus(CANx->RF1, CAN_RF1_RFOV1);
      break;

    case CAN_INT_WK:
      /* Check CAN_MSTS_WKIT bit */
      itstatus = CheckINTStatus(CANx->MSTS, CAN_MSTS_WKIT);
      break;

    case CAN_INT_SAK:
      /* Check CAN_MSTS_SAKIT bit */
      itstatus = CheckINTStatus(CANx->MSTS, CAN_MSTS_SAKIT);
      break;

    case CAN_INT_ERG:
      /* Check CAN_ESTS_ERWF bit */
      itstatus = CheckINTStatus(CANx->ESTS, CAN_ESTS_ERWF);
      break;

    case CAN_INT_ERP:
      /* Check CAN_ESTS_ERPF bit */
      itstatus = CheckINTStatus(CANx->ESTS, CAN_ESTS_ERPF);
      break;

    case CAN_INT_BU:
      /* Check CAN_ESTS_BFF bit */
      itstatus = CheckINTStatus(CANx->ESTS, CAN_ESTS_BFF);
      break;

    case CAN_INT_LEC:
      /* Check CAN_ESTS_ERC bit */
      itstatus = CheckINTStatus(CANx->ESTS, CAN_ESTS_ERC);
      break;

    case CAN_INT_ERR:
      /* Check CAN_MSTS_ERIT bit */
      itstatus = CheckINTStatus(CANx->MSTS, CAN_MSTS_ERIT);
      break;

    default :
      /* in case of error, return RESET */
      itstatus = RESET;
      break;
    }
  }
  else
  {
    /* in case the Interrupt is not enabled, return RESET */
    itstatus  = RESET;
  }

  /* Return the CAN_INT status */
  return  itstatus;
}

/**
  * @brief  Clears the CANx's interrupt pending bits.
  * @param  CANx:    where x can be only 1 to to select the CAN peripheral.
  * @param  CAN_INT: specifies the interrupt pending bit to clear.
  *                  -  CAN_INT_TSME
  *                  -  CAN_INT_RFFU0
  *                  -  CAN_INT_RFOV0
  *                  -  CAN_INT_RFFU1
  *                  -  CAN_INT_RFOV1
  *                  -  CAN_INT_WK
  *                  -  CAN_INT_SAK
  *                  -  CAN_INT_ERG
  *                  -  CAN_INT_ERP
  *                  -  CAN_INT_BU
  *                  -  CAN_INT_LEC
  *                  -  CAN_INT_ERR
  * @retval None.
  */
void CAN_ClearINTPendingBit(CAN_Type* CANx, uint32_t CAN_INT)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_CLEAR_INT(CAN_INT));

  switch (CAN_INT)
  {
  case CAN_INT_TSME:
    /* Clear CAN_TSR_RQCPx (rc_w1)*/
    CANx->TSTS = CAN_TSTS_RQC0 | CAN_TSTS_RQC1 | CAN_TSTS_RQC2;
    break;

