RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_can.c
  case CAN_INT_RFFU0:
    /* Clear CAN_RF0_RFFU0 (rc_w1)*/
    CANx->RF0 = CAN_RF0_RFFU0;
    break;

  case CAN_INT_RFOV0:
    /* Clear CAN_RF0_RFOV0 (rc_w1)*/
    CANx->RF0 = CAN_RF0_RFOV0;
    break;

  case CAN_INT_RFFU1:
    /* Clear CAN_RF1_RFFU1 (rc_w1)*/
    CANx->RF1 = CAN_RF1_RFFU1;
    break;

  case CAN_INT_RFOV1:
    /* Clear CAN_RF1_RFOV1 (rc_w1)*/
    CANx->RF1 = CAN_RF1_RFOV1;
    break;

  case CAN_INT_WK:
    /* Clear CAN_MSTS_WKIT (rc_w1)*/
    CANx->MSTS = CAN_MSTS_WKIT;
    break;

  case CAN_INT_SAK:
    /* Clear CAN_MSTS_SAKIT (rc_w1)*/
    CANx->MSTS = CAN_MSTS_SAKIT;
    break;

  case CAN_INT_ERG:
    /* Clear CAN_MSTS_ERIT (rc_w1) */
    CANx->MSTS = CAN_MSTS_ERIT;
    /* Note : the corresponding Flag is cleared by hardware depending
              of the CAN Bus status*/
    break;

  case CAN_INT_ERP:
    /* Clear CAN_MSTS_ERIT (rc_w1) */
    CANx->MSTS = CAN_MSTS_ERIT;
    /* Note : the corresponding Flag is cleared by hardware depending
              of the CAN Bus status*/
    break;

  case CAN_INT_BU:
    /* Clear CAN_MSTS_ERIT (rc_w1) */
    CANx->MSTS = CAN_MSTS_ERIT;
    /* Note : the corresponding Flag is cleared by hardware depending
              of the CAN Bus status*/
    break;

  case CAN_INT_LEC:
    /*  Clear LEC bits */
    CANx->ESTS = RESET;
    /* Clear CAN_MSTS_ERIT (rc_w1) */
    CANx->MSTS = CAN_MSTS_ERIT;
    break;

  case CAN_INT_ERR:
    /*Clear LEC bits */
    CANx->ESTS = RESET;
    /* Clear CAN_MSTS_ERIT (rc_w1) */
    CANx->MSTS = CAN_MSTS_ERIT;
    /* Note : BOFF, EPVF and EWGF Flags are cleared by hardware depending
            of the CAN Bus status*/
    break;

  default :
    break;
  }
}

/**
  * @brief  Checks whether the CAN interrupt has occurred or not.
  * @param  CAN_Reg: specifies the CAN interrupt register to check.
  * @param  It_Bit:  specifies the interrupt source bit to check.
  * @retval The new state of the CAN Interrupt (SET or RESET).
  */
static ITStatus CheckINTStatus(uint32_t CAN_Reg, uint32_t It_Bit)
{
  ITStatus pendingbitstatus = RESET;

  if ((CAN_Reg & It_Bit) != (uint32_t)RESET)
  {
    /* CAN_INT is set */
    pendingbitstatus = SET;
  }
  else
  {
    /* CAN_INT is reset */
    pendingbitstatus = RESET;
  }

  return pendingbitstatus;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


